JohannesWilde/ArduinoDrivers/avrSrc/iomxx0_1_converted.h
/* Copyright (c) 2005 Anatoly Sokolov 
   All rights reserved.

   Redistribution and use in source and binary forms, with or without
   modification, are permitted provided that the following conditions are met:

   * Redistributions of source code must retain the above copyright
     notice, this list of conditions and the following disclaimer.

   * Redistributions in binary form must reproduce the above copyright
     notice, this list of conditions and the following disclaimer in
     the documentation and/or other materials provided with the
     distribution.

   * Neither the name of the copyright holders nor the names of
     contributors may be used to endorse or promote products derived
     from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
  ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
  LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
  POSSIBILITY OF SUCH DAMAGE. */

/* $Id: iomxx0_1.h 2235 2011-03-17 04:13:14Z arcanum $ */

/* avr/iomxx0_1.h - definitions for ATmega640, Atmega1280, ATmega1281,
   ATmega2560 and ATmega2561. */

#ifndef _AVR_IOMXX0_1_H_
#define _AVR_IOMXX0_1_H_ 1

/* This file should only be included from <avr/io.h>, never directly. */

#ifndef _AVR_IO_H_
#  error "Include <avr/io.h> instead of this file."
#endif

#ifndef _AVR_IOXXX_H_
#  define _AVR_IOXXX_H_ "iomxx0_1.h"
#else
#  error "Attempt to include more than one <avr/ioXXX.h> file."
#endif 

#if defined(__AVR_ATmega640__) || defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
# define __ATmegaxx0__
#elif defined(__AVR_ATmega1281__) || defined(__AVR_ATmega2561__)
# define __ATmegaxx1__
#endif

/* Registers and associated bit numbers */

#define PINA_REGISTER 0X00
#define PINA_TYPE uint8_t
#define PINA_ACCESS _SFR_IO8
#define PINA PINA_ACCESS(PINA_REGISTER)
#define PINA7   7
#define PINA6   6
#define PINA5   5
#define PINA4   4
#define PINA3   3
#define PINA2   2
#define PINA1   1
#define PINA0   0

#define DDRA_REGISTER 0X01
#define DDRA_TYPE uint8_t
#define DDRA_ACCESS _SFR_IO8
#define DDRA DDRA_ACCESS(DDRA_REGISTER)
#define DDA7    7
#define DDA6    6
#define DDA5    5
#define DDA4    4
#define DDA3    3
#define DDA2    2
#define DDA1    1
#define DDA0    0

#define PORTA_REGISTER 0X02
#define PORTA_TYPE uint8_t
#define PORTA_ACCESS _SFR_IO8
#define PORTA PORTA_ACCESS(PORTA_REGISTER)
#define PA7     7
#define PA6     6
#define PA5     5
#define PA4     4
#define PA3     3
#define PA2     2
#define PA1     1
#define PA0     0

#define PINB_REGISTER 0X03
#define PINB_TYPE uint8_t
#define PINB_ACCESS _SFR_IO8
#define PINB PINB_ACCESS(PINB_REGISTER)
#define PINB7   7
#define PINB6   6
#define PINB5   5
#define PINB4   4
#define PINB3   3
#define PINB2   2
#define PINB1   1
#define PINB0   0

#define DDRB_REGISTER 0x04
#define DDRB_TYPE uint8_t
#define DDRB_ACCESS _SFR_IO8
#define DDRB DDRB_ACCESS(DDRB_REGISTER)
#define DDB7    7
#define DDB6    6
#define DDB5    5
#define DDB4    4
#define DDB3    3
#define DDB2    2
#define DDB1    1
#define DDB0    0

#define PORTB_REGISTER 0x05
#define PORTB_TYPE uint8_t
#define PORTB_ACCESS _SFR_IO8
#define PORTB PORTB_ACCESS(PORTB_REGISTER)
#define PB7     7
#define PB6     6
#define PB5     5
#define PB4     4
#define PB3     3
#define PB2     2
#define PB1     1
#define PB0     0

#define PINC_REGISTER 0x06
#define PINC_TYPE uint8_t
#define PINC_ACCESS _SFR_IO8
#define PINC PINC_ACCESS(PINC_REGISTER)
#define PINC7   7
#define PINC6   6
#define PINC5   5
#define PINC4   4
#define PINC3   3
#define PINC2   2
#define PINC1   1
#define PINC0   0

#define DDRC_REGISTER 0x07
#define DDRC_TYPE uint8_t
#define DDRC_ACCESS _SFR_IO8
#define DDRC DDRC_ACCESS(DDRC_REGISTER)
#define DDC7    7
#define DDC6    6
#define DDC5    5
#define DDC4    4
#define DDC3    3
#define DDC2    2
#define DDC1    1
#define DDC0    0

#define PORTC_REGISTER 0x08
#define PORTC_TYPE uint8_t
#define PORTC_ACCESS _SFR_IO8
#define PORTC PORTC_ACCESS(PORTC_REGISTER)
#define PC7     7
#define PC6     6
#define PC5     5
#define PC4     4
#define PC3     3
#define PC2     2
#define PC1     1
#define PC0     0

#define PIND_REGISTER 0x09
#define PIND_TYPE uint8_t
#define PIND_ACCESS _SFR_IO8
#define PIND PIND_ACCESS(PIND_REGISTER)
#define PIND7   7
#define PIND6   6
#define PIND5   5
#define PIND4   4
#define PIND3   3
#define PIND2   2
#define PIND1   1
#define PIND0   0

#define DDRD_REGISTER 0x0A
#define DDRD_TYPE uint8_t
#define DDRD_ACCESS _SFR_IO8
#define DDRD DDRD_ACCESS(DDRD_REGISTER)
#define DDD7    7
#define DDD6    6
#define DDD5    5
#define DDD4    4
#define DDD3    3
#define DDD2    2
#define DDD1    1
#define DDD0    0

#define PORTD_REGISTER 0x0B
#define PORTD_TYPE uint8_t
#define PORTD_ACCESS _SFR_IO8
#define PORTD PORTD_ACCESS(PORTD_REGISTER)
#define PD7     7
#define PD6     6
#define PD5     5
#define PD4     4
#define PD3     3
#define PD2     2
#define PD1     1
#define PD0     0

#define PINE_REGISTER 0x0C
#define PINE_TYPE uint8_t
#define PINE_ACCESS _SFR_IO8
#define PINE PINE_ACCESS(PINE_REGISTER)
#define PINE7   7
#define PINE6   6
#define PINE5   5
#define PINE4   4
#define PINE3   3
#define PINE2   2
#define PINE1   1
#define PINE0   0

#define DDRE_REGISTER 0x0D
#define DDRE_TYPE uint8_t
#define DDRE_ACCESS _SFR_IO8
#define DDRE DDRE_ACCESS(DDRE_REGISTER)
#define DDE7    7
#define DDE6    6
#define DDE5    5
#define DDE4    4
#define DDE3    3
#define DDE2    2
#define DDE1    1
#define DDE0    0

#define PORTE_REGISTER 0x0E
#define PORTE_TYPE uint8_t
#define PORTE_ACCESS _SFR_IO8
#define PORTE PORTE_ACCESS(PORTE_REGISTER)
#define PE7     7
#define PE6     6
#define PE5     5
#define PE4     4
#define PE3     3
#define PE2     2
#define PE1     1
#define PE0     0

#define PINF_REGISTER 0x0F
#define PINF_TYPE uint8_t
#define PINF_ACCESS _SFR_IO8
#define PINF PINF_ACCESS(PINF_REGISTER)
#define PINF7   7
#define PINF6   6
#define PINF5   5
#define PINF4   4
#define PINF3   3
#define PINF2   2
#define PINF1   1
#define PINF0   0

#define DDRF_REGISTER 0x10
#define DDRF_TYPE uint8_t
#define DDRF_ACCESS _SFR_IO8
#define DDRF DDRF_ACCESS(DDRF_REGISTER)
#define DDF7    7
#define DDF6    6
#define DDF5    5
#define DDF4    4
#define DDF3    3
#define DDF2    2
#define DDF1    1
#define DDF0    0

#define PORTF_REGISTER 0x11
#define PORTF_TYPE uint8_t
#define PORTF_ACCESS _SFR_IO8
#define PORTF PORTF_ACCESS(PORTF_REGISTER)
#define PF7     7
#define PF6     6
#define PF5     5
#define PF4     4
#define PF3     3
#define PF2     2
#define PF1     1
#define PF0     0

#define PING_REGISTER 0x12
#define PING_TYPE uint8_t
#define PING_ACCESS _SFR_IO8
#define PING PING_ACCESS(PING_REGISTER)
#define PING5   5
#define PING4   4
#define PING3   3
#define PING2   2
#define PING1   1
#define PING0   0

#define DDRG_REGISTER 0x13
#define DDRG_TYPE uint8_t
#define DDRG_ACCESS _SFR_IO8
#define DDRG DDRG_ACCESS(DDRG_REGISTER)
#define DDG5    5
#define DDG4    4
#define DDG3    3
#define DDG2    2
#define DDG1    1
#define DDG0    0

