JohannesWilde/ArduinoDrivers/avrSrc/iomxx0_1_converted.h
#define PORTG_REGISTER 0x14
#define PORTG_TYPE uint8_t
#define PORTG_ACCESS _SFR_IO8
#define PORTG PORTG_ACCESS(PORTG_REGISTER)
#define PG5     5
#define PG4     4
#define PG3     3
#define PG2     2
#define PG1     1
#define PG0     0

#define TIFR0_REGISTER 0x15
#define TIFR0_TYPE uint8_t
#define TIFR0_ACCESS _SFR_IO8
#define TIFR0 TIFR0_ACCESS(TIFR0_REGISTER)
#define OCF0B   2
#define OCF0A   1
#define TOV0    0

#define TIFR1_REGISTER 0x16
#define TIFR1_TYPE uint8_t
#define TIFR1_ACCESS _SFR_IO8
#define TIFR1 TIFR1_ACCESS(TIFR1_REGISTER)
#define ICF1    5
#define OCF1C   3
#define OCF1B   2
#define OCF1A   1
#define TOV1    0

#define TIFR2_REGISTER 0x17
#define TIFR2_TYPE uint8_t
#define TIFR2_ACCESS _SFR_IO8
#define TIFR2 TIFR2_ACCESS(TIFR2_REGISTER)
#define OCF2B   2
#define OCF2A   1
#define TOV2    0

#define TIFR3_REGISTER 0x18
#define TIFR3_TYPE uint8_t
#define TIFR3_ACCESS _SFR_IO8
#define TIFR3 TIFR3_ACCESS(TIFR3_REGISTER)
#define ICF3    5
#define OCF3C   3
#define OCF3B   2
#define OCF3A   1
#define TOV3    0

#define TIFR4_REGISTER 0x19
#define TIFR4_TYPE uint8_t
#define TIFR4_ACCESS _SFR_IO8
#define TIFR4 TIFR4_ACCESS(TIFR4_REGISTER)
#define ICF4    5
#define OCF4C   3
#define OCF4B   2
#define OCF4A   1
#define TOV4    0

#define TIFR5_REGISTER 0x1A
#define TIFR5_TYPE uint8_t
#define TIFR5_ACCESS _SFR_IO8
#define TIFR5 TIFR5_ACCESS(TIFR5_REGISTER)
#define ICF5    5
#define OCF5C   3
#define OCF5B   2
#define OCF5A   1
#define TOV5    0

#define PCIFR_REGISTER 0x1B
#define PCIFR_TYPE uint8_t
#define PCIFR_ACCESS _SFR_IO8
#define PCIFR PCIFR_ACCESS(PCIFR_REGISTER)
#if defined(__ATmegaxx0__) 
# define PCIF2  2
#endif /* __ATmegaxx0__ */
#define PCIF1   1
#define PCIF0   0

#define EIFR_REGISTER 0x1C
#define EIFR_TYPE uint8_t
#define EIFR_ACCESS _SFR_IO8
#define EIFR EIFR_ACCESS(EIFR_REGISTER)
#define INTF7   7
#define INTF6   6
#define INTF5   5
#define INTF4   4
#define INTF3   3
#define INTF2   2
#define INTF1   1
#define INTF0   0

#define EIMSK_REGISTER 0x1D
#define EIMSK_TYPE uint8_t
#define EIMSK_ACCESS _SFR_IO8
#define EIMSK EIMSK_ACCESS(EIMSK_REGISTER)
#define INT7    7
#define INT6    6
#define INT5    5
#define INT4    4
#define INT3    3
#define INT2    2
#define INT1    1 
#define INT0    0

#define GPIOR0_REGISTER 0x1E
#define GPIOR0_TYPE uint8_t
#define GPIOR0_ACCESS _SFR_IO8
#define GPIOR0 GPIOR0_ACCESS(GPIOR0_REGISTER)

#define EECR_REGISTER 0x1F
#define EECR_TYPE uint8_t
#define EECR_ACCESS _SFR_IO8
#define EECR EECR_ACCESS(EECR_REGISTER)
#define EEPM1   5
#define EEPM0   4
#define EERIE   3
#define EEMPE   2
#define EEPE    1
#define EERE    0

#define EEDR_REGISTER 0X20
#define EEDR_TYPE uint8_t
#define EEDR_ACCESS _SFR_IO8
#define EEDR EEDR_ACCESS(EEDR_REGISTER)

/* Combine EEARL and EEARH */
#define EEAR_REGISTER 0x21
#define EEAR_TYPE uint16_t
#define EEAR_ACCESS _SFR_IO16
#define EEAR EEAR_ACCESS(EEAR_REGISTER)

#define EEARL_REGISTER 0x21
#define EEARL_TYPE uint8_t
#define EEARL_ACCESS _SFR_IO8
#define EEARL EEARL_ACCESS(EEARL_REGISTER)
#define EEARH_REGISTER 0X22
#define EEARH_TYPE uint8_t
#define EEARH_ACCESS _SFR_IO8
#define EEARH EEARH_ACCESS(EEARH_REGISTER)

/* 6-char sequence denoting where to find the EEPROM registers in memory space.
   Adresses denoted in hex syntax with uppercase letters. Used by the EEPROM
   subroutines.
   First two letters:  EECR address.
   Second two letters: EEDR address.
   Last two letters:   EEAR address.  */
#define __EEPROM_REG_LOCATIONS__ 1F2021

#define GTCCR_REGISTER 0x23
#define GTCCR_TYPE uint8_t
#define GTCCR_ACCESS _SFR_IO8
#define GTCCR GTCCR_ACCESS(GTCCR_REGISTER)
#define TSM     7
#define PSRASY  1
#define PSRSYNC 0

#define TCCR0A_REGISTER 0x24
#define TCCR0A_TYPE uint8_t
#define TCCR0A_ACCESS _SFR_IO8
#define TCCR0A TCCR0A_ACCESS(TCCR0A_REGISTER)
#define COM0A1  7
#define COM0A0  6
#define COM0B1  5
#define COM0B0  4
#define WGM01   1
#define WGM00   0

#define TCCR0B_REGISTER 0x25
#define TCCR0B_TYPE uint8_t
#define TCCR0B_ACCESS _SFR_IO8
#define TCCR0B TCCR0B_ACCESS(TCCR0B_REGISTER)
#define FOC0A   7
#define FOC0B   6
#define WGM02   3
#define CS02    2
#define CS01    1
#define CS00    0

#define TCNT0_REGISTER 0X26
#define TCNT0_TYPE uint8_t
#define TCNT0_ACCESS _SFR_IO8
#define TCNT0 TCNT0_ACCESS(TCNT0_REGISTER)

#define OCR0A_REGISTER 0X27
#define OCR0A_TYPE uint8_t
#define OCR0A_ACCESS _SFR_IO8
#define OCR0A OCR0A_ACCESS(OCR0A_REGISTER)

#define OCR0B_REGISTER 0X28
#define OCR0B_TYPE uint8_t
#define OCR0B_ACCESS _SFR_IO8
#define OCR0B OCR0B_ACCESS(OCR0B_REGISTER)

/* Reserved [0x29] */

#define GPIOR1_REGISTER 0x2A
#define GPIOR1_TYPE uint8_t
#define GPIOR1_ACCESS _SFR_IO8
#define GPIOR1 GPIOR1_ACCESS(GPIOR1_REGISTER)

#define GPIOR2_REGISTER 0x2B
#define GPIOR2_TYPE uint8_t
#define GPIOR2_ACCESS _SFR_IO8
#define GPIOR2 GPIOR2_ACCESS(GPIOR2_REGISTER)

#define SPCR_REGISTER 0x2C
#define SPCR_TYPE uint8_t
#define SPCR_ACCESS _SFR_IO8
#define SPCR SPCR_ACCESS(SPCR_REGISTER)
#define SPIE    7
#define SPE     6
#define DORD    5
#define MSTR    4
#define CPOL    3
#define CPHA    2
#define SPR1    1
#define SPR0    0

#define SPSR_REGISTER 0x2D
#define SPSR_TYPE uint8_t
#define SPSR_ACCESS _SFR_IO8
#define SPSR SPSR_ACCESS(SPSR_REGISTER)
#define SPIF    7
#define WCOL    6
#define SPI2X   0

#define SPDR_REGISTER 0X2E
#define SPDR_TYPE uint8_t
#define SPDR_ACCESS _SFR_IO8
#define SPDR SPDR_ACCESS(SPDR_REGISTER)

/* Reserved [0x2F] */

#define ACSR_REGISTER 0x30
#define ACSR_TYPE uint8_t
#define ACSR_ACCESS _SFR_IO8
#define ACSR ACSR_ACCESS(ACSR_REGISTER)
#define ACD     7
#define ACBG    6
#define ACO     5
#define ACI     4
#define ACIE    3
#define ACIC    2
#define ACIS1   1
#define ACIS0   0

#define MONDR_REGISTER 0x31
#define MONDR_TYPE uint8_t
#define MONDR_ACCESS _SFR_IO8
#define MONDR MONDR_ACCESS(MONDR_REGISTER)
#define OCDR_REGISTER 0x31
#define OCDR_TYPE uint8_t
#define OCDR_ACCESS _SFR_IO8
#define OCDR OCDR_ACCESS(OCDR_REGISTER)
#define IDRD    7
#define OCDR7   7
#define OCDR6   6
#define OCDR5   5
#define OCDR4   4
#define OCDR3   3
#define OCDR2   2
#define OCDR1   1
#define OCDR0   0

