JohannesWilde/ArduinoDrivers/avrSrc/iomxx0_1_converted.h
/* Reserved [0x32] */

#define SMCR_REGISTER 0x33
#define SMCR_TYPE uint8_t
#define SMCR_ACCESS _SFR_IO8
#define SMCR SMCR_ACCESS(SMCR_REGISTER)
#define SM2     3
#define SM1     2
#define SM0     1
#define SE      0

#define MCUSR_REGISTER 0x34
#define MCUSR_TYPE uint8_t
#define MCUSR_ACCESS _SFR_IO8
#define MCUSR MCUSR_ACCESS(MCUSR_REGISTER)
#define JTRF    4
#define WDRF    3
#define BORF    2
#define EXTRF   1
#define PORF    0

#define MCUCR_REGISTER 0X35
#define MCUCR_TYPE uint8_t
#define MCUCR_ACCESS _SFR_IO8
#define MCUCR MCUCR_ACCESS(MCUCR_REGISTER)
#define JTD     7
#define PUD     4
#define IVSEL   1
#define IVCE    0

/* Reserved [0x36] */

#define SPMCSR_REGISTER 0x37
#define SPMCSR_TYPE uint8_t
#define SPMCSR_ACCESS _SFR_IO8
#define SPMCSR SPMCSR_ACCESS(SPMCSR_REGISTER)
#define SPMIE   7
#define RWWSB   6
#define SIGRD   5
#define RWWSRE  4
#define BLBSET  3
#define PGWRT   2
#define PGERS   1
#define SPMEN   0

/* Reserved [0x38..0x3A] */

#define RAMPZ_REGISTER 0X3B
#define RAMPZ_TYPE uint8_t
#define RAMPZ_ACCESS _SFR_IO8
#define RAMPZ RAMPZ_ACCESS(RAMPZ_REGISTER)
#define RAMPZ0  0

#define EIND_REGISTER 0X3C
#define EIND_TYPE uint8_t
#define EIND_ACCESS _SFR_IO8
#define EIND EIND_ACCESS(EIND_REGISTER)
#define EIND0   0

/* SP [0x3D..0x3E] */
/* SREG [0x3F] */

#define WDTCSR_REGISTER 0x60
#define WDTCSR_TYPE uint8_t
#define WDTCSR_ACCESS _SFR_MEM8
#define WDTCSR WDTCSR_ACCESS(WDTCSR_REGISTER)
#define WDIF    7
#define WDIE    6
#define WDP3    5
#define WDCE    4
#define WDE     3
#define WDP2    2
#define WDP1    1
#define WDP0    0

#define CLKPR_REGISTER 0x61
#define CLKPR_TYPE uint8_t
#define CLKPR_ACCESS _SFR_MEM8
#define CLKPR CLKPR_ACCESS(CLKPR_REGISTER)
#define CLKPCE  7
#define CLKPS3  3
#define CLKPS2  2
#define CLKPS1  1
#define CLKPS0  0

/* Reserved [0x62..0x63] */

#define PRR0_REGISTER 0x64
#define PRR0_TYPE uint8_t
#define PRR0_ACCESS _SFR_MEM8
#define PRR0 PRR0_ACCESS(PRR0_REGISTER)
#define PRTWI       7
#define PRTIM2      6
#define PRTIM0      5
#define PRTIM1      3
#define PRSPI       2
#define PRUSART0    1
#define PRADC       0

#define __AVR_HAVE_PRR0	((1<<PRADC)|(1<<PRUSART0)|(1<<PRSPI)|(1<<PRTIM1)|(1<<PRTIM0)|(1<<PRTIM2)|(1<<PRTWI))
#define __AVR_HAVE_PRR0_PRADC
#define __AVR_HAVE_PRR0_PRUSART0
#define __AVR_HAVE_PRR0_PRSPI
#define __AVR_HAVE_PRR0_PRTIM1
#define __AVR_HAVE_PRR0_PRTIM0
#define __AVR_HAVE_PRR0_PRTIM2
#define __AVR_HAVE_PRR0_PRTWI

#define PRR1_REGISTER 0x65
#define PRR1_TYPE uint8_t
#define PRR1_ACCESS _SFR_MEM8
#define PRR1 PRR1_ACCESS(PRR1_REGISTER)
#define PRTIM5      5
#define PRTIM4      4
#define PRTIM3      3
#define PRUSART3    2
#define PRUSART2    1
#define PRUSART1    0

#define __AVR_HAVE_PRR1	((1<<PRUSART1)|(1<<PRUSART2)|(1<<PRUSART3)|(1<<PRTIM3)|(1<<PRTIM4)|(1<<PRTIM5))
#define __AVR_HAVE_PRR1_PRUSART1
#define __AVR_HAVE_PRR1_PRUSART2
#define __AVR_HAVE_PRR1_PRUSART3
#define __AVR_HAVE_PRR1_PRTIM3
#define __AVR_HAVE_PRR1_PRTIM4
#define __AVR_HAVE_PRR1_PRTIM5

#define OSCCAL_REGISTER 0x66
#define OSCCAL_TYPE uint8_t
#define OSCCAL_ACCESS _SFR_MEM8
#define OSCCAL OSCCAL_ACCESS(OSCCAL_REGISTER)

/* Reserved [0x67] */

#define PCICR_REGISTER 0x68
#define PCICR_TYPE uint8_t
#define PCICR_ACCESS _SFR_MEM8
#define PCICR PCICR_ACCESS(PCICR_REGISTER)
#if defined(__ATmegaxx0__)
# define PCIE2  2
#endif /* __ATmegaxx0__ */
#define PCIE1   1
#define PCIE0   0

#define EICRA_REGISTER 0x69
#define EICRA_TYPE uint8_t
#define EICRA_ACCESS _SFR_MEM8
#define EICRA EICRA_ACCESS(EICRA_REGISTER)
#define ISC31   7
#define ISC30   6
#define ISC21   5
#define ISC20   4
#define ISC11   3
#define ISC10   2
#define ISC01   1
#define ISC00   0

#define EICRB_REGISTER 0x6A
#define EICRB_TYPE uint8_t
#define EICRB_ACCESS _SFR_MEM8
#define EICRB EICRB_ACCESS(EICRB_REGISTER)
#define ISC71   7
#define ISC70   6
#define ISC61   5
#define ISC60   4
#define ISC51   3
#define ISC50   2
#define ISC41   1
#define ISC40   0

#define PCMSK0_REGISTER 0x6B
#define PCMSK0_TYPE uint8_t
#define PCMSK0_ACCESS _SFR_MEM8
#define PCMSK0 PCMSK0_ACCESS(PCMSK0_REGISTER)
#define PCINT7  7
#define PCINT6  6
#define PCINT5  5
#define PCINT4  4
#define PCINT3  3
#define PCINT2  2
#define PCINT1  1
#define PCINT0  0

#define PCMSK1_REGISTER 0x6C
#define PCMSK1_TYPE uint8_t
#define PCMSK1_ACCESS _SFR_MEM8
#define PCMSK1 PCMSK1_ACCESS(PCMSK1_REGISTER)
#define PCINT15 7
#define PCINT14 6
#define PCINT13 5
#define PCINT12 4
#define PCINT11 3
#define PCINT10 2
#define PCINT9  1
#define PCINT8  0

#if defined(__ATmegaxx0__) 
#define PCMSK2_REGISTER 0x6D
#define PCMSK2_TYPE uint8_t
#define PCMSK2_ACCESS _SFR_MEM8
#define PCMSK2 PCMSK2_ACCESS(PCMSK2_REGISTER)
# define PCINT23 7
# define PCINT22 6
# define PCINT21 5
# define PCINT20 4
# define PCINT19 3
# define PCINT18 2
# define PCINT17 1
# define PCINT16 0
#endif /* __ATmegaxx0__ */

#define TIMSK0_REGISTER 0x6E
#define TIMSK0_TYPE uint8_t
#define TIMSK0_ACCESS _SFR_MEM8
#define TIMSK0 TIMSK0_ACCESS(TIMSK0_REGISTER)
#define OCIE0B  2
#define OCIE0A  1
#define TOIE0   0

#define TIMSK1_REGISTER 0x6F
#define TIMSK1_TYPE uint8_t
#define TIMSK1_ACCESS _SFR_MEM8
#define TIMSK1 TIMSK1_ACCESS(TIMSK1_REGISTER)
#define ICIE1   5
#define OCIE1C  3
#define OCIE1B  2
#define OCIE1A  1
#define TOIE1   0

#define TIMSK2_REGISTER 0x70
#define TIMSK2_TYPE uint8_t
#define TIMSK2_ACCESS _SFR_MEM8
#define TIMSK2 TIMSK2_ACCESS(TIMSK2_REGISTER)
#define OCIE2B  2
#define OCIE2A  1
#define TOIE2   0

#define TIMSK3_REGISTER 0x71
#define TIMSK3_TYPE uint8_t
#define TIMSK3_ACCESS _SFR_MEM8
#define TIMSK3 TIMSK3_ACCESS(TIMSK3_REGISTER)
#define ICIE3   5
#define OCIE3C  3
#define OCIE3B  2
#define OCIE3A  1
#define TOIE3   0

#define TIMSK4_REGISTER 0x72
#define TIMSK4_TYPE uint8_t
#define TIMSK4_ACCESS _SFR_MEM8
#define TIMSK4 TIMSK4_ACCESS(TIMSK4_REGISTER)
#define ICIE4   5
#define OCIE4C  3
#define OCIE4B  2
#define OCIE4A  1
#define TOIE4   0

#define TIMSK5_REGISTER 0x73
#define TIMSK5_TYPE uint8_t
#define TIMSK5_ACCESS _SFR_MEM8
#define TIMSK5 TIMSK5_ACCESS(TIMSK5_REGISTER)
#define ICIE5   5
#define OCIE5C  3
#define OCIE5B  2
#define OCIE5A  1
#define TOIE5   0

