JohannesWilde/ArduinoDrivers/avrSrc/iomxx0_1_converted.h
#define XMCRA_REGISTER 0x74
#define XMCRA_TYPE uint8_t
#define XMCRA_ACCESS _SFR_MEM8
#define XMCRA XMCRA_ACCESS(XMCRA_REGISTER)
#define SRE     7
#define SRL2    6
#define SRL1    5
#define SRL0    4
#define SRW11   3
#define SRW10   2
#define SRW01   1
#define SRW00   0

#define XMCRB_REGISTER 0x75
#define XMCRB_TYPE uint8_t
#define XMCRB_ACCESS _SFR_MEM8
#define XMCRB XMCRB_ACCESS(XMCRB_REGISTER)
#define XMBK    7
#define XMM2    2
#define XMM1    1
#define XMM0    0

/* Reserved [0x76..0x77] */

/* Combine ADCL and ADCH */
#ifndef __ASSEMBLER__
#define ADC_REGISTER 0x78
#define ADC_TYPE uint16_t
#define ADC_ACCESS _SFR_MEM16
#define ADC ADC_ACCESS(ADC_REGISTER)
#endif
#define ADCW_REGISTER 0x78
#define ADCW_TYPE uint16_t
#define ADCW_ACCESS _SFR_MEM16
#define ADCW ADCW_ACCESS(ADCW_REGISTER)
#define ADCL_REGISTER 0x78
#define ADCL_TYPE uint8_t
#define ADCL_ACCESS _SFR_MEM8
#define ADCL ADCL_ACCESS(ADCL_REGISTER)
#define ADCH_REGISTER 0x79
#define ADCH_TYPE uint8_t
#define ADCH_ACCESS _SFR_MEM8
#define ADCH ADCH_ACCESS(ADCH_REGISTER)

#define ADCSRA_REGISTER 0x7A
#define ADCSRA_TYPE uint8_t
#define ADCSRA_ACCESS _SFR_MEM8
#define ADCSRA ADCSRA_ACCESS(ADCSRA_REGISTER)
#define ADEN    7
#define ADSC    6
#define ADATE   5
#define ADIF    4
#define ADIE    3
#define ADPS2   2
#define ADPS1   1
#define ADPS0   0

#define ADCSRB_REGISTER 0x7B
#define ADCSRB_TYPE uint8_t
#define ADCSRB_ACCESS _SFR_MEM8
#define ADCSRB ADCSRB_ACCESS(ADCSRB_REGISTER)
#define ACME    6
#if defined(__ATmegaxx0__)
# define MUX5    3
#endif /* __ATmegaxx0__ */
#define ADTS2   2
#define ADTS1   1
#define ADTS0   0

#define ADMUX_REGISTER 0x7C
#define ADMUX_TYPE uint8_t
#define ADMUX_ACCESS _SFR_MEM8
#define ADMUX ADMUX_ACCESS(ADMUX_REGISTER)
#define REFS1   7
#define REFS0   6
#define ADLAR   5
#define MUX4    4
#define MUX3    3
#define MUX2    2
#define MUX1    1
#define MUX0    0

#define DIDR2_REGISTER 0x7D
#define DIDR2_TYPE uint8_t
#define DIDR2_ACCESS _SFR_MEM8
#define DIDR2 DIDR2_ACCESS(DIDR2_REGISTER)
#define ADC15D  7
#define ADC14D  6
#define ADC13D  5
#define ADC12D  4
#define ADC11D  3
#define ADC10D  2
#define ADC9D   1
#define ADC8D   0

#define DIDR0_REGISTER 0x7E
#define DIDR0_TYPE uint8_t
#define DIDR0_ACCESS _SFR_MEM8
#define DIDR0 DIDR0_ACCESS(DIDR0_REGISTER)
#define ADC7D   7
#define ADC6D   6
#define ADC5D   5
#define ADC4D   4
#define ADC3D   3
#define ADC2D   2
#define ADC1D   1
#define ADC0D   0

#define DIDR1_REGISTER 0x7F
#define DIDR1_TYPE uint8_t
#define DIDR1_ACCESS _SFR_MEM8
#define DIDR1 DIDR1_ACCESS(DIDR1_REGISTER)
#define AIN1D   1
#define AIN0D   0

#define TCCR1A_REGISTER 0x80
#define TCCR1A_TYPE uint8_t
#define TCCR1A_ACCESS _SFR_MEM8
#define TCCR1A TCCR1A_ACCESS(TCCR1A_REGISTER)
#define COM1A1  7
#define COM1A0  6
#define COM1B1  5
#define COM1B0  4
#define COM1C1  3
#define COM1C0  2
#define WGM11   1
#define WGM10   0

#define TCCR1B_REGISTER 0x81
#define TCCR1B_TYPE uint8_t
#define TCCR1B_ACCESS _SFR_MEM8
#define TCCR1B TCCR1B_ACCESS(TCCR1B_REGISTER)
#define ICNC1   7
#define ICES1   6
#define WGM13   4
#define WGM12   3
#define CS12    2
#define CS11    1
#define CS10    0

#define TCCR1C_REGISTER 0x82
#define TCCR1C_TYPE uint8_t
#define TCCR1C_ACCESS _SFR_MEM8
#define TCCR1C TCCR1C_ACCESS(TCCR1C_REGISTER)
#define FOC1A   7
#define FOC1B   6
#define FOC1C   5

/* Reserved [0x83] */

/* Combine TCNT1L and TCNT1H */
#define TCNT1_REGISTER 0x84
#define TCNT1_TYPE uint16_t
#define TCNT1_ACCESS _SFR_MEM16
#define TCNT1 TCNT1_ACCESS(TCNT1_REGISTER)

#define TCNT1L_REGISTER 0x84
#define TCNT1L_TYPE uint8_t
#define TCNT1L_ACCESS _SFR_MEM8
#define TCNT1L TCNT1L_ACCESS(TCNT1L_REGISTER)
#define TCNT1H_REGISTER 0x85
#define TCNT1H_TYPE uint8_t
#define TCNT1H_ACCESS _SFR_MEM8
#define TCNT1H TCNT1H_ACCESS(TCNT1H_REGISTER)

/* Combine ICR1L and ICR1H */
#define ICR1_REGISTER 0x86
#define ICR1_TYPE uint16_t
#define ICR1_ACCESS _SFR_MEM16
#define ICR1 ICR1_ACCESS(ICR1_REGISTER)

#define ICR1L_REGISTER 0x86
#define ICR1L_TYPE uint8_t
#define ICR1L_ACCESS _SFR_MEM8
#define ICR1L ICR1L_ACCESS(ICR1L_REGISTER)
#define ICR1H_REGISTER 0x87
#define ICR1H_TYPE uint8_t
#define ICR1H_ACCESS _SFR_MEM8
#define ICR1H ICR1H_ACCESS(ICR1H_REGISTER)

/* Combine OCR1AL and OCR1AH */
#define OCR1A_REGISTER 0x88
#define OCR1A_TYPE uint16_t
#define OCR1A_ACCESS _SFR_MEM16
#define OCR1A OCR1A_ACCESS(OCR1A_REGISTER)

#define OCR1AL_REGISTER 0x88
#define OCR1AL_TYPE uint8_t
#define OCR1AL_ACCESS _SFR_MEM8
#define OCR1AL OCR1AL_ACCESS(OCR1AL_REGISTER)
#define OCR1AH_REGISTER 0x89
#define OCR1AH_TYPE uint8_t
#define OCR1AH_ACCESS _SFR_MEM8
#define OCR1AH OCR1AH_ACCESS(OCR1AH_REGISTER)

/* Combine OCR1BL and OCR1BH */
#define OCR1B_REGISTER 0x8A
#define OCR1B_TYPE uint16_t
#define OCR1B_ACCESS _SFR_MEM16
#define OCR1B OCR1B_ACCESS(OCR1B_REGISTER)

#define OCR1BL_REGISTER 0x8A
#define OCR1BL_TYPE uint8_t
#define OCR1BL_ACCESS _SFR_MEM8
#define OCR1BL OCR1BL_ACCESS(OCR1BL_REGISTER)
#define OCR1BH_REGISTER 0x8B
#define OCR1BH_TYPE uint8_t
#define OCR1BH_ACCESS _SFR_MEM8
#define OCR1BH OCR1BH_ACCESS(OCR1BH_REGISTER)

/* Combine OCR1CL and OCR1CH */
#define OCR1C_REGISTER 0x8C
#define OCR1C_TYPE uint16_t
#define OCR1C_ACCESS _SFR_MEM16
#define OCR1C OCR1C_ACCESS(OCR1C_REGISTER)

#define OCR1CL_REGISTER 0x8C
#define OCR1CL_TYPE uint8_t
#define OCR1CL_ACCESS _SFR_MEM8
#define OCR1CL OCR1CL_ACCESS(OCR1CL_REGISTER)
#define OCR1CH_REGISTER 0x8D
#define OCR1CH_TYPE uint8_t
#define OCR1CH_ACCESS _SFR_MEM8
#define OCR1CH OCR1CH_ACCESS(OCR1CH_REGISTER)

/* Reserved [0x8E..0x8F] */

#define TCCR3A_REGISTER 0x90
#define TCCR3A_TYPE uint8_t
#define TCCR3A_ACCESS _SFR_MEM8
#define TCCR3A TCCR3A_ACCESS(TCCR3A_REGISTER)
#define COM3A1  7
#define COM3A0  6
#define COM3B1  5
#define COM3B0  4
#define COM3C1  3
#define COM3C0  2
#define WGM31   1
#define WGM30   0

#define TCCR3B_REGISTER 0x91
#define TCCR3B_TYPE uint8_t
#define TCCR3B_ACCESS _SFR_MEM8
#define TCCR3B TCCR3B_ACCESS(TCCR3B_REGISTER)
#define ICNC3   7
#define ICES3   6
#define WGM33   4
#define WGM32   3
#define CS32    2
#define CS31    1
#define CS30    0

#define TCCR3C_REGISTER 0x92
#define TCCR3C_TYPE uint8_t
#define TCCR3C_ACCESS _SFR_MEM8
#define TCCR3C TCCR3C_ACCESS(TCCR3C_REGISTER)
#define FOC3A   7
#define FOC3B   6
#define FOC3C   5

/* Reserved [0x93] */

/* Combine TCNT3L and TCNT3H */
#define TCNT3_REGISTER 0x94
#define TCNT3_TYPE uint16_t
#define TCNT3_ACCESS _SFR_MEM16
#define TCNT3 TCNT3_ACCESS(TCNT3_REGISTER)

#define TCNT3L_REGISTER 0x94
#define TCNT3L_TYPE uint8_t
#define TCNT3L_ACCESS _SFR_MEM8
#define TCNT3L TCNT3L_ACCESS(TCNT3L_REGISTER)
#define TCNT3H_REGISTER 0x95
#define TCNT3H_TYPE uint8_t
#define TCNT3H_ACCESS _SFR_MEM8
#define TCNT3H TCNT3H_ACCESS(TCNT3H_REGISTER)

