JohannesWilde/ArduinoDrivers/avrSrc/iomxx0_1_converted.h
/* Combine ICR3L and ICR3H */
#define ICR3_REGISTER 0x96
#define ICR3_TYPE uint16_t
#define ICR3_ACCESS _SFR_MEM16
#define ICR3 ICR3_ACCESS(ICR3_REGISTER)

#define ICR3L_REGISTER 0x96
#define ICR3L_TYPE uint8_t
#define ICR3L_ACCESS _SFR_MEM8
#define ICR3L ICR3L_ACCESS(ICR3L_REGISTER)
#define ICR3H_REGISTER 0x97
#define ICR3H_TYPE uint8_t
#define ICR3H_ACCESS _SFR_MEM8
#define ICR3H ICR3H_ACCESS(ICR3H_REGISTER)

/* Combine OCR3AL and OCR3AH */
#define OCR3A_REGISTER 0x98
#define OCR3A_TYPE uint16_t
#define OCR3A_ACCESS _SFR_MEM16
#define OCR3A OCR3A_ACCESS(OCR3A_REGISTER)

#define OCR3AL_REGISTER 0x98
#define OCR3AL_TYPE uint8_t
#define OCR3AL_ACCESS _SFR_MEM8
#define OCR3AL OCR3AL_ACCESS(OCR3AL_REGISTER)
#define OCR3AH_REGISTER 0x99
#define OCR3AH_TYPE uint8_t
#define OCR3AH_ACCESS _SFR_MEM8
#define OCR3AH OCR3AH_ACCESS(OCR3AH_REGISTER)

/* Combine OCR3BL and OCR3BH */
#define OCR3B_REGISTER 0x9A
#define OCR3B_TYPE uint16_t
#define OCR3B_ACCESS _SFR_MEM16
#define OCR3B OCR3B_ACCESS(OCR3B_REGISTER)

#define OCR3BL_REGISTER 0x9A
#define OCR3BL_TYPE uint8_t
#define OCR3BL_ACCESS _SFR_MEM8
#define OCR3BL OCR3BL_ACCESS(OCR3BL_REGISTER)
#define OCR3BH_REGISTER 0x9B
#define OCR3BH_TYPE uint8_t
#define OCR3BH_ACCESS _SFR_MEM8
#define OCR3BH OCR3BH_ACCESS(OCR3BH_REGISTER)

/* Combine OCR3CL and OCR3CH */
#define OCR3C_REGISTER 0x9C
#define OCR3C_TYPE uint16_t
#define OCR3C_ACCESS _SFR_MEM16
#define OCR3C OCR3C_ACCESS(OCR3C_REGISTER)

#define OCR3CL_REGISTER 0x9C
#define OCR3CL_TYPE uint8_t
#define OCR3CL_ACCESS _SFR_MEM8
#define OCR3CL OCR3CL_ACCESS(OCR3CL_REGISTER)
#define OCR3CH_REGISTER 0x9D
#define OCR3CH_TYPE uint8_t
#define OCR3CH_ACCESS _SFR_MEM8
#define OCR3CH OCR3CH_ACCESS(OCR3CH_REGISTER)

/* Reserved [0x9E..0x9F] */

#define TCCR4A_REGISTER 0xA0
#define TCCR4A_TYPE uint8_t
#define TCCR4A_ACCESS _SFR_MEM8
#define TCCR4A TCCR4A_ACCESS(TCCR4A_REGISTER)
#define COM4A1  7
#define COM4A0  6
#define COM4B1  5
#define COM4B0  4
#define COM4C1  3
#define COM4C0  2
#define WGM41   1
#define WGM40   0

#define TCCR4B_REGISTER 0xA1
#define TCCR4B_TYPE uint8_t
#define TCCR4B_ACCESS _SFR_MEM8
#define TCCR4B TCCR4B_ACCESS(TCCR4B_REGISTER)
#define ICNC4   7
#define ICES4   6
#define WGM43   4
#define WGM42   3
#define CS42    2
#define CS41    1
#define CS40    0

#define TCCR4C_REGISTER 0xA2
#define TCCR4C_TYPE uint8_t
#define TCCR4C_ACCESS _SFR_MEM8
#define TCCR4C TCCR4C_ACCESS(TCCR4C_REGISTER)
#define FOC4A   7
#define FOC4B   6
#define FOC4C   5

/* Reserved [0xA3] */

/* Combine TCNT4L and TCNT4H */
#define TCNT4_REGISTER 0xA4
#define TCNT4_TYPE uint16_t
#define TCNT4_ACCESS _SFR_MEM16
#define TCNT4 TCNT4_ACCESS(TCNT4_REGISTER)

#define TCNT4L_REGISTER 0xA4
#define TCNT4L_TYPE uint8_t
#define TCNT4L_ACCESS _SFR_MEM8
#define TCNT4L TCNT4L_ACCESS(TCNT4L_REGISTER)
#define TCNT4H_REGISTER 0xA5
#define TCNT4H_TYPE uint8_t
#define TCNT4H_ACCESS _SFR_MEM8
#define TCNT4H TCNT4H_ACCESS(TCNT4H_REGISTER)

/* Combine ICR4L and ICR4H */
#define ICR4_REGISTER 0xA6
#define ICR4_TYPE uint16_t
#define ICR4_ACCESS _SFR_MEM16
#define ICR4 ICR4_ACCESS(ICR4_REGISTER)

#define ICR4L_REGISTER 0xA6
#define ICR4L_TYPE uint8_t
#define ICR4L_ACCESS _SFR_MEM8
#define ICR4L ICR4L_ACCESS(ICR4L_REGISTER)
#define ICR4H_REGISTER 0xA7
#define ICR4H_TYPE uint8_t
#define ICR4H_ACCESS _SFR_MEM8
#define ICR4H ICR4H_ACCESS(ICR4H_REGISTER)

/* Combine OCR4AL and OCR4AH */
#define OCR4A_REGISTER 0xA8
#define OCR4A_TYPE uint16_t
#define OCR4A_ACCESS _SFR_MEM16
#define OCR4A OCR4A_ACCESS(OCR4A_REGISTER)

#define OCR4AL_REGISTER 0xA8
#define OCR4AL_TYPE uint8_t
#define OCR4AL_ACCESS _SFR_MEM8
#define OCR4AL OCR4AL_ACCESS(OCR4AL_REGISTER)
#define OCR4AH_REGISTER 0xA9
#define OCR4AH_TYPE uint8_t
#define OCR4AH_ACCESS _SFR_MEM8
#define OCR4AH OCR4AH_ACCESS(OCR4AH_REGISTER)

/* Combine OCR4BL and OCR4BH */
#define OCR4B_REGISTER 0xAA
#define OCR4B_TYPE uint16_t
#define OCR4B_ACCESS _SFR_MEM16
#define OCR4B OCR4B_ACCESS(OCR4B_REGISTER)

#define OCR4BL_REGISTER 0xAA
#define OCR4BL_TYPE uint8_t
#define OCR4BL_ACCESS _SFR_MEM8
#define OCR4BL OCR4BL_ACCESS(OCR4BL_REGISTER)
#define OCR4BH_REGISTER 0xAB
#define OCR4BH_TYPE uint8_t
#define OCR4BH_ACCESS _SFR_MEM8
#define OCR4BH OCR4BH_ACCESS(OCR4BH_REGISTER)

/* Combine OCR4CL and OCR4CH */
#define OCR4C_REGISTER 0xAC
#define OCR4C_TYPE uint16_t
#define OCR4C_ACCESS _SFR_MEM16
#define OCR4C OCR4C_ACCESS(OCR4C_REGISTER)

#define OCR4CL_REGISTER 0xAC
#define OCR4CL_TYPE uint8_t
#define OCR4CL_ACCESS _SFR_MEM8
#define OCR4CL OCR4CL_ACCESS(OCR4CL_REGISTER)
#define OCR4CH_REGISTER 0xAD
#define OCR4CH_TYPE uint8_t
#define OCR4CH_ACCESS _SFR_MEM8
#define OCR4CH OCR4CH_ACCESS(OCR4CH_REGISTER)

/* Reserved [0xAE..0xAF] */

#define TCCR2A_REGISTER 0xB0
#define TCCR2A_TYPE uint8_t
#define TCCR2A_ACCESS _SFR_MEM8
#define TCCR2A TCCR2A_ACCESS(TCCR2A_REGISTER)
#define COM2A1  7
#define COM2A0  6
#define COM2B1  5
#define COM2B0  4
#define WGM21   1
#define WGM20   0

#define TCCR2B_REGISTER 0xB1
#define TCCR2B_TYPE uint8_t
#define TCCR2B_ACCESS _SFR_MEM8
#define TCCR2B TCCR2B_ACCESS(TCCR2B_REGISTER)
#define FOC2A   7
#define FOC2B   6
#define WGM22   3
#define CS22    2
#define CS21    1
#define CS20    0

#define TCNT2_REGISTER 0xB2
#define TCNT2_TYPE uint8_t
#define TCNT2_ACCESS _SFR_MEM8
#define TCNT2 TCNT2_ACCESS(TCNT2_REGISTER)

#define OCR2A_REGISTER 0xB3
#define OCR2A_TYPE uint8_t
#define OCR2A_ACCESS _SFR_MEM8
#define OCR2A OCR2A_ACCESS(OCR2A_REGISTER)

#define OCR2B_REGISTER 0xB4
#define OCR2B_TYPE uint8_t
#define OCR2B_ACCESS _SFR_MEM8
#define OCR2B OCR2B_ACCESS(OCR2B_REGISTER)

/* Reserved [0xB5] */

#define ASSR_REGISTER 0xB6
#define ASSR_TYPE uint8_t
#define ASSR_ACCESS _SFR_MEM8
#define ASSR ASSR_ACCESS(ASSR_REGISTER)
#define EXCLK   6
#define AS2     5
#define TCN2UB  4
#define OCR2AUB 3
#define OCR2BUB 2
#define TCR2AUB 1
#define TCR2BUB 0

/* Reserved [0xB7] */

#define TWBR_REGISTER 0xB8
#define TWBR_TYPE uint8_t
#define TWBR_ACCESS _SFR_MEM8
#define TWBR TWBR_ACCESS(TWBR_REGISTER)

#define TWSR_REGISTER 0xB9
#define TWSR_TYPE uint8_t
#define TWSR_ACCESS _SFR_MEM8
#define TWSR TWSR_ACCESS(TWSR_REGISTER)
#define TWS7    7
#define TWS6    6
#define TWS5    5
#define TWS4    4
#define TWS3    3
#define TWPS1   1
#define TWPS0   0

#define TWAR_REGISTER 0xBA
#define TWAR_TYPE uint8_t
#define TWAR_ACCESS _SFR_MEM8
#define TWAR TWAR_ACCESS(TWAR_REGISTER)
#define TWA6    7
#define TWA5    6
#define TWA4    5
#define TWA3    4
#define TWA2    3
#define TWA1    2
#define TWA0    1
#define TWGCE   0

#define TWDR_REGISTER 0xBB
#define TWDR_TYPE uint8_t
#define TWDR_ACCESS _SFR_MEM8
#define TWDR TWDR_ACCESS(TWDR_REGISTER)

#define TWCR_REGISTER 0xBC
#define TWCR_TYPE uint8_t
#define TWCR_ACCESS _SFR_MEM8
#define TWCR TWCR_ACCESS(TWCR_REGISTER)
#define TWINT   7
#define TWEA    6
#define TWSTA   5
#define TWSTO   4
#define TWWC    3
#define TWEN    2
#define TWIE    0

#define TWAMR_REGISTER 0xBD
#define TWAMR_TYPE uint8_t
#define TWAMR_ACCESS _SFR_MEM8
#define TWAMR TWAMR_ACCESS(TWAMR_REGISTER)
#define TWAM6   7
#define TWAM5   6
#define TWAM4   5
#define TWAM3   4
#define TWAM2   3
#define TWAM1   2
#define TWAM0   1

