JohannesWilde/ArduinoDrivers/avrSrc/iomxx0_1_converted.h
/* Reserved [0xBE..0xBF] */

#define UCSR0A_REGISTER 0xC0
#define UCSR0A_TYPE uint8_t
#define UCSR0A_ACCESS _SFR_MEM8
#define UCSR0A UCSR0A_ACCESS(UCSR0A_REGISTER)
#define RXC0    7
#define TXC0    6
#define UDRE0   5
#define FE0     4
#define DOR0    3
#define UPE0    2
#define U2X0    1
#define MPCM0   0

#define UCSR0B_REGISTER 0XC1
#define UCSR0B_TYPE uint8_t
#define UCSR0B_ACCESS _SFR_MEM8
#define UCSR0B UCSR0B_ACCESS(UCSR0B_REGISTER)
#define RXCIE0  7
#define TXCIE0  6
#define UDRIE0  5
#define RXEN0   4
#define TXEN0   3
#define UCSZ02  2
#define RXB80   1
#define TXB80   0

#define UCSR0C_REGISTER 0xC2
#define UCSR0C_TYPE uint8_t
#define UCSR0C_ACCESS _SFR_MEM8
#define UCSR0C UCSR0C_ACCESS(UCSR0C_REGISTER)
#define UMSEL01 7
#define UMSEL00 6
#define UPM01   5
#define UPM00   4
#define USBS0   3
#define UCSZ01  2
#define UCSZ00  1
#define UCPOL0  0

/* Reserved [0xC3] */

/* Combine UBRR0L and UBRR0H */
#define UBRR0_REGISTER 0xC4
#define UBRR0_TYPE uint16_t
#define UBRR0_ACCESS _SFR_MEM16
#define UBRR0 UBRR0_ACCESS(UBRR0_REGISTER)

#define UBRR0L_REGISTER 0xC4
#define UBRR0L_TYPE uint8_t
#define UBRR0L_ACCESS _SFR_MEM8
#define UBRR0L UBRR0L_ACCESS(UBRR0L_REGISTER)
#define UBRR0H_REGISTER 0xC5
#define UBRR0H_TYPE uint8_t
#define UBRR0H_ACCESS _SFR_MEM8
#define UBRR0H UBRR0H_ACCESS(UBRR0H_REGISTER)

#define UDR0_REGISTER 0XC6
#define UDR0_TYPE uint8_t
#define UDR0_ACCESS _SFR_MEM8
#define UDR0 UDR0_ACCESS(UDR0_REGISTER)

/* Reserved [0xC7] */

#define UCSR1A_REGISTER 0xC8
#define UCSR1A_TYPE uint8_t
#define UCSR1A_ACCESS _SFR_MEM8
#define UCSR1A UCSR1A_ACCESS(UCSR1A_REGISTER)
#define RXC1    7
#define TXC1    6
#define UDRE1   5
#define FE1     4
#define DOR1    3
#define UPE1    2
#define U2X1    1
#define MPCM1   0

#define UCSR1B_REGISTER 0XC9
#define UCSR1B_TYPE uint8_t
#define UCSR1B_ACCESS _SFR_MEM8
#define UCSR1B UCSR1B_ACCESS(UCSR1B_REGISTER)
#define RXCIE1  7
#define TXCIE1  6
#define UDRIE1  5
#define RXEN1   4
#define TXEN1   3
#define UCSZ12  2
#define RXB81   1
#define TXB81   0

#define UCSR1C_REGISTER 0xCA
#define UCSR1C_TYPE uint8_t
#define UCSR1C_ACCESS _SFR_MEM8
#define UCSR1C UCSR1C_ACCESS(UCSR1C_REGISTER)
#define UMSEL11 7
#define UMSEL10 6
#define UPM11   5
#define UPM10   4
#define USBS1   3
#define UCSZ11  2
#define UCSZ10  1
#define UCPOL1  0

/* Reserved [0xCB] */

/* Combine UBRR1L and UBRR1H */
#define UBRR1_REGISTER 0xCC
#define UBRR1_TYPE uint16_t
#define UBRR1_ACCESS _SFR_MEM16
#define UBRR1 UBRR1_ACCESS(UBRR1_REGISTER)

#define UBRR1L_REGISTER 0xCC
#define UBRR1L_TYPE uint8_t
#define UBRR1L_ACCESS _SFR_MEM8
#define UBRR1L UBRR1L_ACCESS(UBRR1L_REGISTER)
#define UBRR1H_REGISTER 0xCD
#define UBRR1H_TYPE uint8_t
#define UBRR1H_ACCESS _SFR_MEM8
#define UBRR1H UBRR1H_ACCESS(UBRR1H_REGISTER)

#define UDR1_REGISTER 0XCE
#define UDR1_TYPE uint8_t
#define UDR1_ACCESS _SFR_MEM8
#define UDR1 UDR1_ACCESS(UDR1_REGISTER)

/* Reserved [0xCF] */

#if defined(__ATmegaxx0__)

#define UCSR2A_REGISTER 0xD0
#define UCSR2A_TYPE uint8_t
#define UCSR2A_ACCESS _SFR_MEM8
#define UCSR2A UCSR2A_ACCESS(UCSR2A_REGISTER)
# define RXC2   7
# define TXC2   6
# define UDRE2  5
# define FE2    4
# define DOR2   3
# define UPE2   2
# define U2X2   1
# define MPCM2  0

#define UCSR2B_REGISTER 0XD1
#define UCSR2B_TYPE uint8_t
#define UCSR2B_ACCESS _SFR_MEM8
#define UCSR2B UCSR2B_ACCESS(UCSR2B_REGISTER)
# define RXCIE2 7
# define TXCIE2 6
# define UDRIE2 5
# define RXEN2  4
# define TXEN2  3
# define UCSZ22 2
# define RXB82  1
# define TXB82  0

#define UCSR2C_REGISTER 0xD2
#define UCSR2C_TYPE uint8_t
#define UCSR2C_ACCESS _SFR_MEM8
#define UCSR2C UCSR2C_ACCESS(UCSR2C_REGISTER)
# define UMSEL21 7
# define UMSEL20 6
# define UPM21  5
# define UPM20  4
# define USBS2  3
# define UCSZ21 2
# define UCSZ20 1
# define UCPOL2 0

/* Reserved [0xD3] */

/* Combine UBRR2L and UBRR2H */
#define UBRR2_REGISTER 0xD4
#define UBRR2_TYPE uint16_t
#define UBRR2_ACCESS _SFR_MEM16
#define UBRR2 UBRR2_ACCESS(UBRR2_REGISTER)

#define UBRR2L_REGISTER 0xD4
#define UBRR2L_TYPE uint8_t
#define UBRR2L_ACCESS _SFR_MEM8
#define UBRR2L UBRR2L_ACCESS(UBRR2L_REGISTER)
#define UBRR2H_REGISTER 0xD5
#define UBRR2H_TYPE uint8_t
#define UBRR2H_ACCESS _SFR_MEM8
#define UBRR2H UBRR2H_ACCESS(UBRR2H_REGISTER)

#define UDR2_REGISTER 0XD6
#define UDR2_TYPE uint8_t
#define UDR2_ACCESS _SFR_MEM8
#define UDR2 UDR2_ACCESS(UDR2_REGISTER)

#endif /* __ATmegaxx0__ */

/* Reserved [0xD7..0xFF] */

#if defined(__ATmegaxx0__)

#define PINH_REGISTER 0x100
#define PINH_TYPE uint8_t
#define PINH_ACCESS _SFR_MEM8
#define PINH PINH_ACCESS(PINH_REGISTER)
# define PINH7  7
# define PINH6  6
# define PINH5  5
# define PINH4  4
# define PINH3  3
# define PINH2  2
# define PINH1  1
# define PINH0  0

#define DDRH_REGISTER 0x101
#define DDRH_TYPE uint8_t
#define DDRH_ACCESS _SFR_MEM8
#define DDRH DDRH_ACCESS(DDRH_REGISTER)
# define DDH7   7
# define DDH6   6
# define DDH5   5
# define DDH4   4
# define DDH3   3
# define DDH2   2
# define DDH1   1
# define DDH0   0

#define PORTH_REGISTER 0x102
#define PORTH_TYPE uint8_t
#define PORTH_ACCESS _SFR_MEM8
#define PORTH PORTH_ACCESS(PORTH_REGISTER)
# define PH7    7
# define PH6    6
# define PH5    5
# define PH4    4
# define PH3    3
# define PH2    2
# define PH1    1
# define PH0    0

#define PINJ_REGISTER 0x103
#define PINJ_TYPE uint8_t
#define PINJ_ACCESS _SFR_MEM8
#define PINJ PINJ_ACCESS(PINJ_REGISTER)
# define PINJ7  7
# define PINJ6  6
# define PINJ5  5
# define PINJ4  4
# define PINJ3  3
# define PINJ2  2
# define PINJ1  1
# define PINJ0  0

#define DDRJ_REGISTER 0x104
#define DDRJ_TYPE uint8_t
#define DDRJ_ACCESS _SFR_MEM8
#define DDRJ DDRJ_ACCESS(DDRJ_REGISTER)
# define DDJ7   7
# define DDJ6   6
# define DDJ5   5
# define DDJ4   4
# define DDJ3   3
# define DDJ2   2
# define DDJ1   1
# define DDJ0   0

#define PORTJ_REGISTER 0x105
#define PORTJ_TYPE uint8_t
#define PORTJ_ACCESS _SFR_MEM8
#define PORTJ PORTJ_ACCESS(PORTJ_REGISTER)
# define PJ7 7
# define PJ6 6
# define PJ5 5
# define PJ4 4
# define PJ3 3
# define PJ2 2
# define PJ1 1
# define PJ0 0

