JohannesWilde/ArduinoDrivers/avrSrc/iomxx0_1_converted.h
#define PINK_REGISTER 0x106
#define PINK_TYPE uint8_t
#define PINK_ACCESS _SFR_MEM8
#define PINK PINK_ACCESS(PINK_REGISTER)
# define PINK7  7
# define PINK6  6
# define PINK5  5
# define PINK4  4
# define PINK3  3
# define PINK2  2
# define PINK1  1
# define PINK0  0

#define DDRK_REGISTER 0x107
#define DDRK_TYPE uint8_t
#define DDRK_ACCESS _SFR_MEM8
#define DDRK DDRK_ACCESS(DDRK_REGISTER)
# define DDK7   7
# define DDK6   6
# define DDK5   5
# define DDK4   4
# define DDK3   3
# define DDK2   2
# define DDK1   1
# define DDK0   0

#define PORTK_REGISTER 0x108
#define PORTK_TYPE uint8_t
#define PORTK_ACCESS _SFR_MEM8
#define PORTK PORTK_ACCESS(PORTK_REGISTER)
# define PK7 7
# define PK6 6
# define PK5 5
# define PK4 4
# define PK3 3
# define PK2 2
# define PK1 1
# define PK0 0

#define PINL_REGISTER 0x109
#define PINL_TYPE uint8_t
#define PINL_ACCESS _SFR_MEM8
#define PINL PINL_ACCESS(PINL_REGISTER)
# define PINL7  7
# define PINL6  6
# define PINL5  5
# define PINL4  4
# define PINL3  3
# define PINL2  2
# define PINL1  1
# define PINL0  0

#define DDRL_REGISTER 0x10A
#define DDRL_TYPE uint8_t
#define DDRL_ACCESS _SFR_MEM8
#define DDRL DDRL_ACCESS(DDRL_REGISTER)
# define DDL7   7
# define DDL6   6
# define DDL5   5
# define DDL4   4
# define DDL3   3
# define DDL2   2
# define DDL1   1
# define DDL0   0

#define PORTL_REGISTER 0x10B
#define PORTL_TYPE uint8_t
#define PORTL_ACCESS _SFR_MEM8
#define PORTL PORTL_ACCESS(PORTL_REGISTER)
# define PL7 7
# define PL6 6
# define PL5 5
# define PL4 4
# define PL3 3
# define PL2 2
# define PL1 1
# define PL0 0

#endif /* __ATmegaxx0__ */

/* Reserved [0x10C..0x11F] */

#define TCCR5A_REGISTER 0x120
#define TCCR5A_TYPE uint8_t
#define TCCR5A_ACCESS _SFR_MEM8
#define TCCR5A TCCR5A_ACCESS(TCCR5A_REGISTER)
#define COM5A1  7
#define COM5A0  6
#define COM5B1  5
#define COM5B0  4
#define COM5C1  3
#define COM5C0  2
#define WGM51   1
#define WGM50   0

#define TCCR5B_REGISTER 0x121
#define TCCR5B_TYPE uint8_t
#define TCCR5B_ACCESS _SFR_MEM8
#define TCCR5B TCCR5B_ACCESS(TCCR5B_REGISTER)
#define ICNC5   7
#define ICES5   6
#define WGM53   4
#define WGM52   3
#define CS52    2
#define CS51    1
#define CS50    0

#define TCCR5C_REGISTER 0x122
#define TCCR5C_TYPE uint8_t
#define TCCR5C_ACCESS _SFR_MEM8
#define TCCR5C TCCR5C_ACCESS(TCCR5C_REGISTER)
#define FOC5A   7
#define FOC5B   6
#define FOC5C   5

/* Reserved [0x123] */

/* Combine TCNT5L and TCNT5H */
#define TCNT5_REGISTER 0x124
#define TCNT5_TYPE uint16_t
#define TCNT5_ACCESS _SFR_MEM16
#define TCNT5 TCNT5_ACCESS(TCNT5_REGISTER)

#define TCNT5L_REGISTER 0x124
#define TCNT5L_TYPE uint8_t
#define TCNT5L_ACCESS _SFR_MEM8
#define TCNT5L TCNT5L_ACCESS(TCNT5L_REGISTER)
#define TCNT5H_REGISTER 0x125
#define TCNT5H_TYPE uint8_t
#define TCNT5H_ACCESS _SFR_MEM8
#define TCNT5H TCNT5H_ACCESS(TCNT5H_REGISTER)

/* Combine ICR5L and ICR5H */
#define ICR5_REGISTER 0x126
#define ICR5_TYPE uint16_t
#define ICR5_ACCESS _SFR_MEM16
#define ICR5 ICR5_ACCESS(ICR5_REGISTER)

#define ICR5L_REGISTER 0x126
#define ICR5L_TYPE uint8_t
#define ICR5L_ACCESS _SFR_MEM8
#define ICR5L ICR5L_ACCESS(ICR5L_REGISTER)
#define ICR5H_REGISTER 0x127
#define ICR5H_TYPE uint8_t
#define ICR5H_ACCESS _SFR_MEM8
#define ICR5H ICR5H_ACCESS(ICR5H_REGISTER)

/* Combine OCR5AL and OCR5AH */
#define OCR5A_REGISTER 0x128
#define OCR5A_TYPE uint16_t
#define OCR5A_ACCESS _SFR_MEM16
#define OCR5A OCR5A_ACCESS(OCR5A_REGISTER)

#define OCR5AL_REGISTER 0x128
#define OCR5AL_TYPE uint8_t
#define OCR5AL_ACCESS _SFR_MEM8
#define OCR5AL OCR5AL_ACCESS(OCR5AL_REGISTER)
#define OCR5AH_REGISTER 0x129
#define OCR5AH_TYPE uint8_t
#define OCR5AH_ACCESS _SFR_MEM8
#define OCR5AH OCR5AH_ACCESS(OCR5AH_REGISTER)

/* Combine OCR5BL and OCR5BH */
#define OCR5B_REGISTER 0x12A
#define OCR5B_TYPE uint16_t
#define OCR5B_ACCESS _SFR_MEM16
#define OCR5B OCR5B_ACCESS(OCR5B_REGISTER)

#define OCR5BL_REGISTER 0x12A
#define OCR5BL_TYPE uint8_t
#define OCR5BL_ACCESS _SFR_MEM8
#define OCR5BL OCR5BL_ACCESS(OCR5BL_REGISTER)
#define OCR5BH_REGISTER 0x12B
#define OCR5BH_TYPE uint8_t
#define OCR5BH_ACCESS _SFR_MEM8
#define OCR5BH OCR5BH_ACCESS(OCR5BH_REGISTER)

/* Combine OCR5CL and OCR5CH */
#define OCR5C_REGISTER 0x12C
#define OCR5C_TYPE uint16_t
#define OCR5C_ACCESS _SFR_MEM16
#define OCR5C OCR5C_ACCESS(OCR5C_REGISTER)

#define OCR5CL_REGISTER 0x12C
#define OCR5CL_TYPE uint8_t
#define OCR5CL_ACCESS _SFR_MEM8
#define OCR5CL OCR5CL_ACCESS(OCR5CL_REGISTER)
#define OCR5CH_REGISTER 0x12D
#define OCR5CH_TYPE uint8_t
#define OCR5CH_ACCESS _SFR_MEM8
#define OCR5CH OCR5CH_ACCESS(OCR5CH_REGISTER)

/* Reserved [0x12E..0x12F] */

#if defined(__ATmegaxx0__) 

#define UCSR3A_REGISTER 0x130
#define UCSR3A_TYPE uint8_t
#define UCSR3A_ACCESS _SFR_MEM8
#define UCSR3A UCSR3A_ACCESS(UCSR3A_REGISTER)
# define RXC3   7
# define TXC3   6
# define UDRE3  5
# define FE3    4
# define DOR3   3
# define UPE3   2
# define U2X3   1
# define MPCM3  0

#define UCSR3B_REGISTER 0X131
#define UCSR3B_TYPE uint8_t
#define UCSR3B_ACCESS _SFR_MEM8
#define UCSR3B UCSR3B_ACCESS(UCSR3B_REGISTER)
# define RXCIE3 7
# define TXCIE3 6
# define UDRIE3 5
# define RXEN3  4
# define TXEN3  3
# define UCSZ32 2
# define RXB83  1
# define TXB83  0

#define UCSR3C_REGISTER 0x132
#define UCSR3C_TYPE uint8_t
#define UCSR3C_ACCESS _SFR_MEM8
#define UCSR3C UCSR3C_ACCESS(UCSR3C_REGISTER)
# define UMSEL31 7
# define UMSEL30 6
# define UPM31  5
# define UPM30  4
# define USBS3  3
# define UCSZ31 2
# define UCSZ30 1
# define UCPOL3 0

/* Reserved [0x133] */

/* Combine UBRR3L and UBRR3H */
#define UBRR3_REGISTER 0x134
#define UBRR3_TYPE uint16_t
#define UBRR3_ACCESS _SFR_MEM16
#define UBRR3 UBRR3_ACCESS(UBRR3_REGISTER)

#define UBRR3L_REGISTER 0x134
#define UBRR3L_TYPE uint8_t
#define UBRR3L_ACCESS _SFR_MEM8
#define UBRR3L UBRR3L_ACCESS(UBRR3L_REGISTER)
#define UBRR3H_REGISTER 0x135
#define UBRR3H_TYPE uint8_t
#define UBRR3H_ACCESS _SFR_MEM8
#define UBRR3H UBRR3H_ACCESS(UBRR3H_REGISTER)

#define UDR3_REGISTER 0X136
#define UDR3_TYPE uint8_t
#define UDR3_ACCESS _SFR_MEM8
#define UDR3 UDR3_ACCESS(UDR3_REGISTER)

#endif /* __ATmegaxx0__ */

/* Reserved [0x137..1FF] */

/* Interrupt vectors */
/* Vector 0 is the reset vector */
/* External Interrupt Request 0 */
#define INT0_vect_num		1
#define INT0_vect			_VECTOR(1)
#define SIG_INTERRUPT0			_VECTOR(1)

/* External Interrupt Request 1 */
#define INT1_vect_num		2
#define INT1_vect			_VECTOR(2)
#define SIG_INTERRUPT1			_VECTOR(2)

/* External Interrupt Request 2 */
#define INT2_vect_num		3
#define INT2_vect			_VECTOR(3)
#define SIG_INTERRUPT2			_VECTOR(3)

/* External Interrupt Request 3 */
#define INT3_vect_num		4
#define INT3_vect			_VECTOR(4)
#define SIG_INTERRUPT3			_VECTOR(4)

/* External Interrupt Request 4 */
#define INT4_vect_num		5
#define INT4_vect			_VECTOR(5)
#define SIG_INTERRUPT4			_VECTOR(5)

/* External Interrupt Request 5 */
#define INT5_vect_num		6
#define INT5_vect			_VECTOR(6)
#define SIG_INTERRUPT5			_VECTOR(6)

